# เขียนโปรแกรม รับชื่อ อายุ ทางแป้นพิมพ์ แล้วแสดงผลออกมาว่า ชื่อ อายุนั้น เป็นเด็ก คนหนุ่ม หรือคนแก่
# อายุน้อยกว่า 18 คือ เด็ก / อายุ 19 - 45 คือ คนหนุ่ม / อายุ 46 ขึ้นไป คือ คนแก่ 

# หาฟีเจอร์การทำงาน เพื่อจะเอาไปเขียนเป็นฟังก์ชัน
# ฟีเจอร์ รับค่าข้อมูล , ตรวจสอบและแสดงผลว่าเป็น เด็ก คนหนุ่ม หรือคนแก่ , แสดงชื่อโปรแกรม

def showProgramName ( ) :
    print (' โปรแกรมตรวจสอบความเป็นเด็ก คนหนุ่ม หรือ คนแก่')
    
def InputData( ):
    name = input('ท่านชื่อ : ')
    age = int(input('ท่านอายุ : '))
    return name,age

def checkShowStatus ( name , age ) :
    if age <= 18 :
        print(f'คุณ {name} อายุ {age} ปี อยู่วัยเด็ก')
    elif age >= 19 and age <= 45 :
        print(f'คุณ {name} อายุ {age} ปี อยู่วัยหนุ่มสาว')
    else :
        print(f'คุณ {name} อายุ {age} ปี อยู่วัยสูงอายุ')
        
print('---------------------------------------------------')
showProgramName()
print('---------------------------------------------------')
name,age = InputData()
print('---------------------------------------------------')
checkShowStatus ( name , age )
print('---------------------------------------------------')